; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image1 - mode
	infrared3 - mode
	infrared4 - mode
	thermograph7 - mode
	spectrograph8 - mode
	image6 - mode
	spectrograph10 - mode
	spectrograph2 - mode
	thermograph0 - mode
	infrared5 - mode
	spectrograph9 - mode
	Star2 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation3 - direction
	Star1 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image6)
	(supports instrument0 image1)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph8)
	(supports instrument1 image1)
	(supports instrument1 thermograph7)
	(supports instrument1 spectrograph10)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 spectrograph8)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph9)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(have_image Planet5 spectrograph9)
	(have_image Planet5 thermograph0)
	(have_image Star6 image1)
	(have_image Star6 infrared5)
	(have_image Star7 infrared3)
	(have_image Phenomenon8 infrared3)
	(have_image Phenomenon9 image1)
))

)

; plan
1. (turn_to satellite1 star1 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star1)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation4 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon8 instrument3 infrared3)
   added: (have_image phenomenon8 infrared3)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (turn_to satellite0 phenomenon9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 7
10. (take_image satellite0 phenomenon9 instrument0 image1)
   added: (have_image phenomenon9 image1)
   goals met: 2 of 7
11. (turn_to satellite0 star6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star6)
   goals met: 2 of 7
12. (take_image satellite0 star6 instrument0 image1)
   added: (have_image star6 image1)
   goals met: 3 of 7
13. (take_image satellite0 star6 instrument0 infrared5)
   added: (have_image star6 infrared5)
   goals met: 4 of 7
14. (turn_to satellite1 planet5 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet5)
   goals met: 4 of 7
15. (take_image satellite1 planet5 instrument3 spectrograph9)
   added: (have_image planet5 spectrograph9)
   goals met: 5 of 7
16. (take_image satellite1 planet5 instrument3 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 6 of 7
17. (turn_to satellite1 star7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star7)
   goals met: 6 of 7
18. (take_image satellite1 star7 instrument3 infrared3)
   added: (have_image star7 infrared3)
   goals met: 7 of 7
